# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "awscli"
brew "bash" # Latest Bash version
brew "bat" # "cat" on steroids
brew "bit-git"
brew "composer"
brew "coreutils" # Those that come with macOS are outdated
brew "dnsmasq", restart_service: true
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg2"
brew "grep"
brew "httpie"
brew "hub"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openjdk"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "stripe"
brew "svn"
brew "trash" # Manage the Trash bin
brew "tree" # List directories in a tree structure
brew "zlib" # Needed for Memcached

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "php", restart_service: true
brew "php@7.3"
brew "php@7.2"
brew "composer"
brew "imagemagick"
brew "libmemcached"
brew "memcached"
brew "mysql"
brew "postgresql"
brew "nginx", restart_service: true
brew "node"
brew "redis"
brew "tesseract-lang"
brew "yarn"

# Apps

cask "1password"
cask "1password-cli"
cask "aerial"
cask "alfred"
cask "bartender"
cask "caffeine"
cask "dbngin"
cask "discord"
cask "docker"
cask "figma"
cask "freedom"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "harvest"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "java"
cask "notion"
cask "quicklook-csv"
cask "quicklook-json"
cask "screenflow"
cask "skype"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "the-unarchiver"
cask "tinkerwell"
cask "transmission"
cask "transmit"
cask "vagrant"
cask "vlc"
cask "whatsapp"

# Fonts
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
