# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "awscli"
brew "bash" # Latest Bash version
brew "bat" # "cat" on steroids
brew "bit-git"
brew "composer"
brew "coreutils" # Those that come with macOS are outdated
brew "dnsmasq", restart_service: true
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg2"
brew "grep"
brew "httpie"
brew "hub"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openjdk"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash" # Manage the Trash bin
brew "tree" # List directories in a tree structure
brew "zlib" # Needed for Memcached

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "php"
brew "php@7.4"
brew "composer"
brew "imagemagick"
brew "libmemcached"
brew "memcached"
brew "nginx"
brew "node"
brew "redis"
brew "tesseract-lang"
brew "yarn"

# Apps

cask "1password"
cask "1password-cli"
cask "alfred"
cask "docker"
cask "figma"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "harvest"
cask "iterm2"
cask "java"
cask "notion"
cask "quicklook-csv"
cask "quicklook-json"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "tinkerwell"
cask "whatsapp"
cask 'zoom'
cask 'phpstorm'

# Fonts
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
